{
  "config": {
    "output_layers": [
      [
        "dense_3",
        0,
        0
      ]
    ],
    "layers": [
      {
        "config": {
          "dtype": "float32",
          "name": "input_2",
          "batch_input_shape": [
            null,
            34
          ],
          "sparse": false
        },
        "name": "input_2",
        "inbound_nodes": [],
        "class_name": "InputLayer"
      },
      {
        "config": {
          "dtype": "float32",
          "name": "input_1",
          "batch_input_shape": [
            null,
            2048
          ],
          "sparse": false
        },
        "name": "input_1",
        "inbound_nodes": [],
        "class_name": "InputLayer"
      },
      {
        "config": {
          "input_length": null,
          "embeddings_constraint": null,
          "name": "embedding_1",
          "output_dim": 200,
          "input_dim": 1652,
          "embeddings_initializer": {
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            },
            "class_name": "RandomUniform"
          },
          "activity_regularizer": null,
          "trainable": false,
          "embeddings_regularizer": null,
          "dtype": "float32",
          "batch_input_shape": [
            null,
            null
          ],
          "mask_zero": true
        },
        "name": "embedding_1",
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Embedding"
      },
      {
        "config": {
          "name": "dropout_1",
          "noise_shape": null,
          "trainable": true,
          "seed": null,
          "dtype": "float32",
          "rate": 0.4
        },
        "name": "dropout_1",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Dropout"
      },
      {
        "config": {
          "name": "dropout_2",
          "noise_shape": null,
          "trainable": true,
          "seed": null,
          "dtype": "float32",
          "rate": 0.4
        },
        "name": "dropout_2",
        "inbound_nodes": [
          [
            [
              "embedding_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Dropout"
      },
      {
        "config": {
          "use_bias": true,
          "kernel_regularizer": null,
          "activity_regularizer": null,
          "kernel_initializer": {
            "config": {
              "mode": "fan_avg",
              "scale": 1,
              "seed": null,
              "distribution": "uniform"
            },
            "class_name": "VarianceScaling"
          },
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "kernel_constraint": null,
          "name": "dense_1",
          "bias_regularizer": null,
          "trainable": true,
          "units": 256,
          "dtype": "float32",
          "activation": "relu",
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Dense"
      },
      {
        "config": {
          "return_sequences": false,
          "use_bias": true,
          "recurrent_activation": "sigmoid",
          "stateful": false,
          "kernel_initializer": {
            "config": {
              "mode": "fan_avg",
              "scale": 1,
              "seed": null,
              "distribution": "uniform"
            },
            "class_name": "VarianceScaling"
          },
          "recurrent_constraint": null,
          "implementation": 2,
          "recurrent_dropout": 0,
          "units": 256,
          "return_state": false,
          "unroll": false,
          "activity_regularizer": null,
          "unit_forget_bias": true,
          "dropout": 0,
          "kernel_regularizer": null,
          "go_backwards": false,
          "recurrent_initializer": {
            "config": {
              "gain": 1,
              "seed": null
            },
            "class_name": "Orthogonal"
          },
          "bias_constraint": null,
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "kernel_constraint": null,
          "name": "lstm_1",
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "trainable": true,
          "dtype": "float32",
          "activation": "tanh"
        },
        "name": "lstm_1",
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "LSTM"
      },
      {
        "config": {
          "dtype": "float32",
          "name": "add_1",
          "trainable": true
        },
        "name": "add_1",
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ],
            [
              "lstm_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Add"
      },
      {
        "config": {
          "use_bias": true,
          "kernel_regularizer": null,
          "activity_regularizer": null,
          "kernel_initializer": {
            "config": {
              "mode": "fan_avg",
              "scale": 1,
              "seed": null,
              "distribution": "uniform"
            },
            "class_name": "VarianceScaling"
          },
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "kernel_constraint": null,
          "name": "dense_2",
          "bias_regularizer": null,
          "trainable": true,
          "units": 128,
          "dtype": "float32",
          "activation": "relu",
          "bias_constraint": null
        },
        "name": "dense_2",
        "inbound_nodes": [
          [
            [
              "add_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Dense"
      },
      {
        "config": {
          "use_bias": true,
          "kernel_regularizer": null,
          "activity_regularizer": null,
          "kernel_initializer": {
            "config": {
              "mode": "fan_avg",
              "scale": 1,
              "seed": null,
              "distribution": "uniform"
            },
            "class_name": "VarianceScaling"
          },
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "kernel_constraint": null,
          "name": "dense_3",
          "bias_regularizer": null,
          "trainable": true,
          "units": 1652,
          "dtype": "float32",
          "activation": "softmax",
          "bias_constraint": null
        },
        "name": "dense_3",
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "class_name": "Dense"
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ],
      [
        "input_2",
        0,
        0
      ]
    ],
    "name": "model_1"
  },
  "keras_version": "2.3.1",
  "backend": "tensorflow",
  "class_name": "Model"
}
