{"class_name": "Model", "keras_version": "2.3.1", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 34], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"output_dim": 200, "input_length": null, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": true, "batch_input_shape": [null, null], "dtype": "float32", "trainable": false, "input_dim": 1652, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "dtype": "float32", "rate": 0.4, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "dtype": "float32", "rate": 0.4, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_1", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "units": 256}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "LSTM", "config": {"unroll": false, "kernel_constraint": null, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "name": "lstm_1", "implementation": 2, "recurrent_dropout": 0.0, "return_sequences": false, "bias_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "go_backwards": false, "recurrent_constraint": null, "bias_constraint": null, "return_state": false, "unit_forget_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "lstm_1"}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add_1", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "use_bias": true, "name": "dense_2", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "units": 128}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_3", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "units": 1652}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3"}], "name": "model_1"}, "backend": "tensorflow"}